START_MESSAGE = """Это бот DeepSeek + Qwen в Telegram. 
По умолчанию выбрана нейросеть deepseek-ai/DeepSeek-R1. Просто выберите нужную нейросеть или сразу напишите ваш запрос.

Команды:
/start - начать использование
/restart - перезапуск бота 🌟
/info - информацию о боте ℹ️
/help - получить помощь 🆘
/clear - Очистка истории запросов 🧹
/model - посмотреть выбранную модель 🤖
/setmodel - выбрать модель 🤖
"""

RESTART_MESSAGE = """Бот перезапущен.
Установленны настройки по умолчанию:
ℹ️ Используемая модель - deepseek-ai/DeepSeek-R1.
ℹ️ История запросов очищенна.

Посмототреть спиок команд можно по команде /help
"""

HELP_MESSAGE = """
Команды:
/start - начать использование
/sretart - перезапуск бота 🌟
/info - информацию о боте ℹ️
/help - получить помощь 🆘
/clear - Очистка истории запросов 🧹
/model - посмотреть выбранную модель 🤖
/setmodel - выбрать модель 🤖

Поддержка🆘: @Geniusmediocrity
"""

INFO_MESSAGE = """📚 О боте:

Бот работает через официальный API DeepSeek, Qwen, Mistral, microsoft, а также доступен выбор других ИИ моделей.
Бот полностью бесплатный.🤑

Владелец😎: @Geniusmediocrity
Поддержка🆘: @Geniusmediocrity

Если остались вопросы или что-то не работает пишите мне в тг(ссылка выше).❔

Приятного использования!🍀
"""

ANSWER_PROCESSING = """
💭 Ещё чуть-чуть, готовлю ответ
⏳ Примерное время ожидания 20 секунд.
Подождите перед тем, как отправить следующий вопрос . . ."""
