class Messages:

    START_MESSAGE = """Привет! Я — ИИ асистент.

Я умею:
- Генерировать текст: Пишу тексты разных жанров и стилей — от рассказов до писем.
- Отвечать на вопросы: Стараюсь давать точные и полезные ответы.
- Переводить языки: Могу переводить текст между языками.
- Обобщать информацию: Кратко излагаю большие тексты.
- Вести беседу: Поддерживаю разговор на любые темы.
- Работать с различными типами фото
- Работать с текстовыми файлам(.doc, .docx, .txt)(Тестовая версия)

Посмототреть спиок команд можно по команде или обратиться за помощью можно по команде /help
Просто напиши свой вопрос и я постараюсь на него ответить.
Итак, чем могу помочь?
    """

    RESTART_MESSAGE = """Бот перезапущен.
Установленны настройки по умолчанию:
❔ Используемая модель - deepseek-ai/DeepSeek-R1.
❔ История запросов очищенна.

Посмототреть спиок команд можно по команде /help
    """

    HELP_MESSAGE = """
Мои команды:
start - Начать использование
restart - Перезапуск бота
info - Информацию о боте
help - Получить помощь
clear - Очистка истории запросов
model - Посмотреть выбранную модель
setmodel - Выбрать модель
visualmodel - Посмотреть выбранную фото-модель
setvisualmodel - Выбрать фото-модель для использования

Поддержка🆘: @Geniusmediocrity
    """

    INFO_MESSAGE = """📚 О боте:

Бот работает через официальный API DeepSeek, Qwen, Mistral, microsoft, а также доступен выбор других ИИ моделей.
Бот полностью бесплатный.

Владелец😎: @Geniusmediocrity
Поддержка🆘: @Geniusmediocrity

Если остались вопросы или что-то не работает пишите мне в тг(ссылка выше).
Приятного использования!🍀
    """

    ANSWER_PROCESSING = """
💭 Ещё чуть-чуть, готовлю ответ
⏳ Примерное время ожидания 30 секунд.
Подождите перед тем, как отправить следующий вопрос . . ."""
